[M_Allium_ThanksgivingMission01 MissionDefinition]
MissionDescription="Trgo invites you to the Trgo Society Hunger Show, where Pandora's kids can test their skills against the Vatla Gobbler. If you find Torg, he will teach you how to survive this battle and body explosion.."
TurnInDescription="Eat healthy food!"
MissionSummary="God knows a fool."

[M_Allium_ThanksgivingMission01:AddTheGravySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Trgo invites you to the Trgo Society Hunger Show, where Pandora's kids can test their skills against the Vatla Gobbler. If you find Torg, he will teach you how to survive this battle and body explosion.. First, though, you need to prepare a meal for the Gobbler that you can then poison. You've got the meat and the poison -- just poison some gravy and add it to the meat. Once that's done, you'll be ready to cook."

[M_Allium_ThanksgivingMission01:DefeatGobbler3 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mr. Torg invites you to Torg's Fierce-Maiden Fantasy, where Pandora's criminals can test their mettle against a hidden mystery..<br><br>Torg says the Gobbler War is over; Previous opponents died due to invincibility (e.g. invincible Cromerax, which is the "invincible" part of the game). Wattle Gobbler..<br><br>After boiling, grinding, poisoning, and hunting, the Wattle Gobbler can finally be killed. Go get your hair cut."

[M_Allium_ThanksgivingMission01:DefeatTribute1Set MissionObjectiveSetDefinition]
MissionSummaryOverride="i can eat."
MissionDescriptionOverride="Teacher: Torg brings you Torg's song of violence as the villains of Pandora take on the evil Wattle Gobbler..<br><br>Torg reveals to him that Gabler's battle was heroic. All the tall ones fought the invincibles (like really invincible, not "invincible Chromerax", the "no" part here is sarcastic) Wattle Gubbler..<br><br>Turg's invincibility to remove Poison Gobbler. If you do, you can kill him and get your reward..<br><br>But what should be cooked first is food that can cause poisoning. Torg tells him to go to the kitchen to find some delicious food.."

[M_Allium_ThanksgivingMission01:FindJabberSurpriseTributeSet MissionObjectiveSetDefinition]
MissionSummaryOverride="it ruined his reputation."
MissionDescriptionOverride="Targa Boss invites you to the Targa game "Hungry Violence" where Pandora's doll tests her strength with the Wattle Gobbler..<br><br>Targ will tell you that fighting the Gobbler is pointless - the first opponent is the completely invincible Whitlock Gobbler (well, not defeated, the episode "Crowmerx the Invincible" is great)..<br><br>You must kill the eagle to remove its weakness from Torg. After doing this, you can get your reward for the kill.<br><br>First you cook, then you can cause death. Cutting meat will poison you. Targ advises you to find Jabber's bat and steal the poison. Now you have to worry about death threats from Torgo's boss.."

[M_Allium_ThanksgivingMission01:FindStabjackerNestsSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Take the poison."
MissionDescriptionOverride="Mr. Tork invites you to Tork Corporation's Hunger of Violence extravaganza, where Pandora's villains can test their mettle against the hungry willows..<br><br>Torg tells you that the Gobblers are dead - all challengers before them die mercilessly (actually, mercilessly, not like the invincible Kravmareks, where the "invulnerable" part is ironic). A voracious eater.<br><br>Turgo tells you to poison the Gobblers to remove their invulnerability. Once you do this, you can kill him and get a reward.<br><br>In any case, the food must first be ready to eat, and then it is poisoned. You must find poison in living flesh. Torge advises you to find the listening Torge Staber Jabber Corporation and steal some of his poison glands.."

[M_Allium_ThanksgivingMission01:GameShowStartingSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Trgo invites you to the Trgo Society Hunger Show, where Pandora's kids can test their skills against the Vatla Gobbler. If you find Torg, he will teach you how to survive this battle and body explosion..<br><br>First, you'll have to enter the Torgue broadcast set. Just hand in your admission ticket and you'll be free to enter."

[M_Allium_ThanksgivingMission01:GrabMeatSet MissionObjectiveSetDefinition]
MissionSummaryOverride="i can eat."
MissionDescriptionOverride="Teacher: Torg brings you Torg's song of violence as the villains of Pandora take on the evil Wattle Gobbler..<br><br>Torg reveals to him that Gabler's battle was heroic. All the tall ones fought the invincibles (like really invincible, not "invincible Chromerax", the "no" part here is sarcastic) Wattle Gubbler..<br><br>Turg's invincibility to remove Poison Gobbler. If you do, you can kill him and get your reward..<br><br>But what should be cooked first is food that can cause poisoning. Torg tells him to go to the kitchen to find some delicious food.."

[M_Allium_ThanksgivingMission01:HeadToKichenSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Go to the kitchen."
MissionDescriptionOverride="Mr. Togg invites you to Togg's "Hunger Camp" facility, where the evil hordes of Pandora can challenge themselves to the Acacia Birds..<br><br>Torg tells you that the Gobbler War has gone too far: everyone in the Wattle Gobbler is inexplicably dead (well, inexplicably, really, the "Cramrex disappeared" and the "immortal" part is starvation). <br><br>You must flip the blocks to eliminate the Gobbler. Once completed, you can click on it and claim your reward..<br><br>But first you need to prepare the conditions for poisoning. I asked him to go to the kitchen and find something delicious.."

[M_Allium_ThanksgivingMission01:KillChefsSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Turn off the stove."
MissionDescriptionOverride="Teacher: Torg brings you Torg's song of violence as the villains of Pandora take on the evil Wattle Gobbler..<br><br>Torg reveals to him that Gabler's battle was heroic. All the tall ones fought the invincibles (like really invincible, not "invincible Chromerax", the "no" part here is sarcastic) Wattle Gubbler..<br><br>Turg's invincibility to remove Poison Gobbler. If you do, you can kill him and get your reward..<br><br>But what should be cooked first is food that can cause poisoning. Torg tells him to go to the kitchen to find some delicious food..<br><br>Unfortunately, the Torgue corporation's chefs aren't psyched about the prospect of a Vault Hunter stealing their meat and cooking up a poison smorgasbord. You'll have to fight your way through them to get to the meat."

[M_Allium_ThanksgivingMission01:MoveMeatIntoPlaceSet MissionObjectiveSetDefinition]
MissionSummaryOverride="cut the meat."
MissionDescriptionOverride="Welcome to Targo Corporation's epic Hunger Games where the pirates of Pandora face the wrath of the Wattle Gobbler..<br><br>Torg says that the fight with Gobbler was a mistake - all of Invincible's old adversaries are dead (like Invincible Kraumerex, not Invincible Kraumerex). (This is the "invincible" part) Wattle Gobbler.<br><br>You need to poison Torg Gobbler and weaken him. If you succeed, you can get kills and rewards.<br><br>But first you have to prepare the dish you want to eat. Now is the time to digest the meat you have into delicious food.."

[M_Allium_ThanksgivingMission01:PoisonGobblerSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride="Cliff hump."
MissionDescriptionOverride="Wren Tog invites you to join the hunger feast Tog for violence. There the criminals in Pandora can test their skills against the hungry 'Ai Mull'..<br><br>Doc tells them that Gubler's war was stolen. All previous partners have failed. (For example, the "invincible" part of "Chromerax the Invincible" is not a joke; it's not impossible.).<br><br>To clear obstacles on the ground, the ball must be poisoned. Then you can kill and pay.."

[M_Allium_ThanksgivingMission01:PoisonTheGravySet MissionObjectiveSetDefinition]
MissionSummaryOverride="Eat poison."
MissionDescriptionOverride="Trgo invites you to the Trgo Society Hunger Show, where Pandora's kids can test their skills against the Vatla Gobbler. If you find Torg, he will teach you how to survive this battle and body explosion.. First, though, you need to prepare a meal for the Gobbler that you can then poison. You've got the meat and the poison -- just poison some gravy and add it to the meat. Once that's done, you'll be ready to cook."

[M_Allium_ThanksgivingMission01:SlagTheJackersSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Wren Tog invites you to join the hunger feast Tog for violence. There the criminals in Pandora can test their skills against the hungry 'Ai Mull'..<br><br>Doc tells them that Gubler's war was stolen. All previous partners have failed. (For example, the "invincible" part of "Chromerax the Invincible" is not a joke; it's not impossible.).<br><br>To clear obstacles on the ground, the ball must be poisoned. Then you can kill and pay..<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. With the meat grinded up, you need to find some poison. Torgue has recommended you find the Torgue corporation stabber jabber nests and steal some of their poison glands.\nYou'll need to slag the jabbers, then kill them, then grab their glands.<br><br>Once that's done, you'll need to put the poison into some gravy -- the Gobbler ain't gonna eat poison all on its own."

[M_Allium_ThanksgivingMission01:StartFoodPreparationSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Store food while cooking."
MissionDescriptionOverride="Wren Tog invites you to join the hunger feast Tog for violence. There the criminals in Pandora can test their skills against the hungry 'Ai Mull'..<br><br>Doc tells them that Gubler's war was stolen. All previous partners have failed. (For example, the "invincible" part of "Chromerax the Invincible" is not a joke; it's not impossible.).<br><br>To clear obstacles on the ground, the ball must be poisoned. Then you can kill and pay..<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. The meal's all ready, but you still have to cook it. You'll need to defend the oven while it bakes."

[M_Allium_ThanksgivingMission01:SurviveGobblerSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Gobbler survived the attack."
MissionDescriptionOverride="Wren Tog invites you to join the hunger feast Tog for violence. There the criminals in Pandora can test their skills against the hungry 'Ai Mull'..<br><br>Doc tells them that Gubler's war was stolen. All previous partners have failed. (For example, the "invincible" part of "Chromerax the Invincible" is not a joke; it's not impossible.).<br><br>To clear obstacles on the ground, the ball must be poisoned. Then you can kill and pay..<br><br>You poisoned the Gobbler, but it hasn't yet taken effect -- you'll have to survive long enough for your poison to really start working."

[M_Allium_ThanksgivingMission01:TakeFoodOutOfOvenSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Place the food in the oven."
MissionDescriptionOverride="Wren Tog invites you to join the hunger feast Tog for violence. There the criminals in Pandora can test their skills against the hungry 'Ai Mull'..<br><br>Doc tells them that Gubler's war was stolen. All previous partners have failed. (For example, the "invincible" part of "Chromerax the Invincible" is not a joke; it's not impossible.).<br><br>To clear obstacles on the ground, the ball must be poisoned. Then you can kill and pay..<br><br>First, though, you need to prepare a meal for the Gobbler that you can then poison. The meal is done cooking -- just take it out of the oven."

[M_Allium_ThanksgivingMission01:takeyourpositionset MissionObjectiveSetDefinition]
MissionSummaryOverride="Look in the pan."
MissionDescriptionOverride="Wren Tog invites you to join the hunger feast Tog for violence. There the criminals in Pandora can test their skills against the hungry 'Ai Mull'..<br><br>Doc tells them that Gubler's war was stolen. All previous partners have failed. (For example, the "invincible" part of "Chromerax the Invincible" is not a joke; it's not impossible.).<br><br>To clear obstacles on the ground, the ball must be poisoned. Then you can kill and pay.. For now, though, you just need to jump into an elevator and ascend to the [place]Grove of the Gobbler[-place]."

[M_Allium_ThanksgivingMission01:TalkToTorgueSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Trgo invites you to the Trgo Society Hunger Show, where Pandora's kids can test their skills against the Vatla Gobbler. If you find Torg, he will teach you how to survive this battle and body explosion.."

[M_Allium_ThanksgivingMission01:TributeDefeatedSet MissionObjectiveSetDefinition]
MissionSummaryOverride="i can eat."
MissionDescriptionOverride="Teacher: Torg brings you Torg's song of violence as the villains of Pandora take on the evil Wattle Gobbler..<br><br>Torg reveals to him that Gabler's battle was heroic. All the tall ones fought the invincibles (like really invincible, not "invincible Chromerax", the "no" part here is sarcastic) Wattle Gubbler..<br><br>Turg's invincibility to remove Poison Gobbler. If you do, you can kill him and get your reward..<br><br>But what should be cooked first is food that can cause poisoning. Torg tells him to go to the kitchen to find some delicious food.."

[M_Allium_ThanksgivingMission01:WatchTorgueShowSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Trgo invites you to the Trgo Society Hunger Show, where Pandora's kids can test their skills against the Vatla Gobbler. If you find Torg, he will teach you how to survive this battle and body explosion..<br><br>Mister Torgue is currently broadcasting. You'll have to wait for him to finish his show before you can talk to him."
